shell.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<title>シェルスクリプトの倉庫</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="シェルスクリプトの倉庫"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-07-14 14:54:02 JST"/>
<meta name="author" content="Yuuhi"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="./bootstrap.min.css">
<link rel="stylesheet" type="text/css" href="./org-mode.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">シェルスクリプトの倉庫</h1>


    <div class='navbar navbar-fixed-top'>
      <div class='navbar-inner'>
        <div class='container'>
          <a class='brand' href='/memo/index.html'>ねこねここねこ</a>
          <ul class='nav'>
            <li>
              <a href='#sec-1'>Twitterクライアント</a>
            </li>
            <li>
              <a href='#sec-2'>戦略シミュレーションゲーム</a>
            </li>
          </ul>
        </div>
      </div>
    </div>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Shellスクリプトで正規表現を使う方法</a></li>
<li><a href="#sec-2">2 diffとpatchコマンドを使い方</a></li>
<li><a href="#sec-3">3 nkfとlatexの</a></li>
<li><a href="#sec-4">4 rename</a></li>
<li><a href="#sec-5">5 platex</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Shellスクリプトで正規表現を使う方法</h2>
<div class="outline-text-2" id="text-1">

<p><a href="http://freebsd.g.hatena.ne.jp/py4s-tnk/20070728/1188319980">http://freebsd.g.hatena.ne.jp/py4s-tnk/20070728/1188319980</a>
</p>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> diffとpatchコマンドを使い方</h2>
<div class="outline-text-2" id="text-2">


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> nkfとlatexの</h2>
<div class="outline-text-2" id="text-3">

<p>if文での正規表現の使い方も覚えておこう
</p>


<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">bash</span>

<span style="color: #00ffff;">for</span> s<span style="color: #00ffff;"> in</span> <span style="color: #fa8072;">`ls`</span>
<span style="color: #00ffff;">do</span>
    <span style="color: #00ffff;">if</span> expr <span style="color: #ffa07a;">"$s"</span> : <span style="color: #ffa07a;">".*\.tex"</span> &gt;/dev/null; <span style="color: #00ffff;">then</span>
        <span style="color: #b0c4de;">echo</span> $<span style="color: #eedd82;">s</span><span style="color: #ffa07a;">"utf8-&gt;"</span>$<span style="color: #eedd82;">s</span>
        nkf -w8 $<span style="color: #eedd82;">s</span> &gt; temp-$<span style="color: #eedd82;">s</span>
        mv temp-$<span style="color: #eedd82;">s</span> $<span style="color: #eedd82;">s</span>
    <span style="color: #00ffff;">fi</span>
<span style="color: #00ffff;">done</span>

platex main.tex ; dvipdfmx main.dvi ; open main.pdf
</pre>


</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> rename</h2>
<div class="outline-text-2" id="text-4">




<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">bash</span>

<span style="color: #00ffff;">for</span> s<span style="color: #00ffff;"> in</span> <span style="color: #fa8072;">`ls`</span>
<span style="color: #00ffff;">do</span>
    <span style="color: #00ffff;">case</span> $<span style="color: #eedd82;">s</span><span style="color: #00ffff;"> in</span>
        $<span style="color: #eedd82;">1</span>.pdf) mv $<span style="color: #eedd82;">1</span>.pdf $<span style="color: #eedd82;">2</span>.pdf ;;
        $<span style="color: #eedd82;">1</span>.dvi) mv $<span style="color: #eedd82;">1</span>.dvi $<span style="color: #eedd82;">2</span>.dvi ;;
        $<span style="color: #eedd82;">1</span>.tex) mv $<span style="color: #eedd82;">1</span>.tex $<span style="color: #eedd82;">2</span>.tex ;;
    <span style="color: #00ffff;">esac</span>
<span style="color: #00ffff;">done</span>
</pre>


</div>

</div>

<div id="outline-container-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> platex</h2>
<div class="outline-text-2" id="text-5">




<pre class="src src-sh"><span style="color: #ff7f24;">#</span><span style="color: #ff7f24;">!/bin/</span><span style="color: #00ffff;">sh</span>

<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#12371;&#12398;&#12473;&#12463;&#12522;&#12503;&#12488;&#12399;"./build.sh &#12501;&#12449;&#12452;&#12523;&#21517; &#12392;&#12377;&#12427;&#12371;&#12392;&#12391;pdf&#12434;&#21520;&#12367;"</span>
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">&#12501;&#12449;&#12452;&#12523;&#21517;&#12395;&#12399;&#25313;&#24373;&#23376;&#12434;&#21547;&#12417;&#12394;&#12356;</span>

<span style="color: #eedd82;">name</span>=$<span style="color: #eedd82;">1</span>
(platex $<span style="color: #eedd82;">name</span><span style="color: #ffa07a;">".tex"</span> &amp;&amp; platex $<span style="color: #eedd82;">name</span><span style="color: #ffa07a;">".tex"</span> &amp;&amp; dvipdfmx $<span style="color: #eedd82;">name</span><span style="color: #ffa07a;">".dvi"</span> &amp;&amp; open $<span style="color: #eedd82;">name</span><span style="color: #ffa07a;">".pdf"</span>) || <span style="color: #b0c4de;">echo</span> <span style="color: #ffa07a;">'error!'</span>

rm *~
rm *.aux
rm *.bbl
rm *.blg
rm *.dvi
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">rm *.log</span>
rm *.lot
rm *.lof
rm *.toc
<span style="color: #ff7f24;"># </span><span style="color: #ff7f24;">rm \#*\#</span>
</pre>

</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-07-14 14:54:02 JST</p>
<p class="author">Author: Yuuhi</p>
<p class="creator">Org version 7.8.03 with Emacs version 23</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
